// See https://aka.ms/new-console-template for more information

//запрашиваем число
//Console.Write("Input number:");

//создаем переменную number и сохраняем в нее значение, введенное из консоли
//int number = Convert.ToInt32 (Console.ReadLine());

//выводим значение переменной number
//Console.WriteLine(number + "->" + number*number);

//вводим первое число
//Console.Write("Input first number:");
//сохраняем значение в переменную
//int number_1 = Convert.ToInt32 (Console.ReadLine());
//Console.Write("Input second number:");
//int number_2 = Convert.ToInt32 (Console.ReadLine());
//оцениваем, является ли первое число квадратом второго
//if (number_1 == number_2*number_2)
   // Console.WriteLine("a = " + number_1 + ", b = " + number_2 + " -> " + " yes");
//else
    //Console.WriteLine("a = " + number_1 + ", b = " + number_2 + " -> " + " no");


//Домашнее задание к семинару № 1 по C#

//Задача № 2.

//вариант разбора на семинаре

//Console.Write("Input first number:");
//int number_1 = Convert.ToInt32 (Console.ReadLine());
//Console.Write("Input second number:");
//int number_2 = Convert.ToInt32 (Console.ReadLine());
//if (number_1 > number_2){
//Console.WriteLine(number_1 + " больше " + number_2);
//}
//else if (number_1 < number_2){
 //   Console.WriteLine(number_1 + " меньше " + number_2);
//}
//else {
 //  Console.WriteLine("значения чисел одинаковы");
//}

//Свой первоначальный вариант (не совсем верно учла условие задачи (ЧТО надо вывести на экран) - не столько максимум, сколько то, какое число больше/меньше второго. Ну и про лишнее if не учла)

//Console.Write("Input first number:");
//int number_1 = Convert.ToInt32 (Console.ReadLine());
//Console.Write("Input second number:");
//int number_2 = Convert.ToInt32 (Console.ReadLine());
//if (number_1 > number_2)
//Console.WriteLine("a = " + number_1 + ", b = " + number_2 + " -> " + " max == a");
//else 
//    Console.WriteLine("a = " + number_1 + ", b = " + number_2 + " -> " + "max == b");
//if (number_1 == number_2)
//   Console.WriteLine("a = " + number_1 + ", b = " + number_2 + "->" + " max is not found. The values of the variables are equal");

//Задача № 4.

//Console.Write("Input first number:");
//int number_1 = Convert.ToInt32 (Console.ReadLine());
//Console.Write("Input second number:");
//int number_2 = Convert.ToInt32 (Console.ReadLine());
//Console.Write("Input third number:");
//int number_3 = Convert.ToInt32 (Console.ReadLine());
//if (number_1>number_2 && number_1>number_3){
 //   Console.WriteLine("max: " + number_1);
 //   }
//else if (number_2>number_1 && number_2 > number_3){
//    Console.WriteLine("max: " + number_2);
//    }
//else if (number_3 > number_1 && number_3 > number_2){
//    Console.WriteLine("max: " + number_3);
//    }
//else {Console.WriteLine("Введенны одинаковые значения");
//}

//Задача № 6.

//Console.Write("Input number:");
//int number = Convert.ToInt32 (Console.ReadLine());
//if (number %2 ==0){
//    Console.WriteLine("число четное");
//}
//else {
//    Console.WriteLine("число нечетное");
//}



